app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    puts "---------------------------------"
    puts params.inspect
    puts "---------------------------------"
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `avatar_file_name`, `avatar_file_size`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `avatar_content_type`, `remember_token`, `login`, `avatar_updated_at`, `email`) VALUES('Norat', '0c606ee36f5379ce106f88fe9a49972c86402f83', NULL, NULL, '2011-07-02 05:20:41', '2d2b5e5f946f165720cb15bf6a079e3e21941741', NULL, '2011-07-02 05:20:41', NULL, NULL, 'norat', NULL, 'noratsaraswat@yahoo.com')